# Data cleaning

In [1]:
# import libraries
import pandas as pd
import numpy as np
import os

In [3]:
path=r'/Users/sofiakazeko/Jupiter/Achievement 6 - University Rankings'

In [4]:
df_cwur = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'cwurData.csv'), index_col = False)

In [5]:
df_cwur.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [6]:
#Finding Missing Values
df_cwur.isnull().sum()

world_rank                0
institution               0
country                   0
national_rank             0
quality_of_education      0
alumni_employment         0
quality_of_faculty        0
publications              0
influence                 0
citations                 0
broad_impact            200
patents                   0
score                     0
year                      0
dtype: int64

In [8]:
df_cwur.shape

(2200, 14)

Since "Broad Impact" in CWUR is based on the h-index (which measures research influence), the best way to handle missing values is to keep it as is for transparency. If the "Broad Impact" column is empty for certain universities, it may be due to insufficient data to calculate a meaningful h-index, possibly resulting from a lower volume of published research or fewer citations. Leaving it as NaN accurately reflects that it does not have a measurable broad impact. If needed for analysis "Missing Impact" column can be created to track universities without h-index data

In [9]:
#check for mixed types
for col in df_cwur.columns.tolist():
  weird = (df_cwur[[col]].map(type) != df_cwur[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cwur[weird]) > 0:
    print (col)

In [39]:
#finding duplicates
df_dups1 = df_cwur[df_cwur.duplicated()]

In [40]:
df_dups1

Empty DataFrame
Columns: [world_rank, institution, country, national_rank, quality_of_education, alumni_employment, quality_of_faculty, publications, influence, citations, broad_impact, patents, score, year]
Index: []

In [71]:
df_cwur.describe

<bound method NDFrame.describe of       world_rank                            institution         country  \
0              1                     Harvard University             USA
1              2  Massachusetts Institute of Technology             USA
2              3                    Stanford University             USA
3              4                University of Cambridge  United Kingdom
4              5     California Institute of Technology             USA
...          ...                                    ...             ...
2195         996              University of the Algarve        Portugal
2196         997                  Alexandria University           Egypt
2197         998            Federal University of Ceará          Brazil
2198         999                 University of A Coruña           Spain
2199        1000        China Pharmaceutical University           China

      national_rank  quality_of_education  alumni_employment  \
0                 1                     7                  9
1                 2                     9                 17
2                 3                    17                 11
3                 1                    10                 24
4                 4                     2                 29
...             ...                   ...                ...
2195              7                   367                567
2196              4                   236                566
2197             18                   367                549
2198             40                   367                567
2199             83                   367                567

      quality_of_faculty  publications  influence  citations  broad_impact  \
0                      1             1          1          1           NaN
1                      3            12          4          4           NaN
2                      5             4          2          2           NaN
3                      4            16         16         11           NaN
4                      7            37         22         22           NaN
...                  ...           ...        ...        ...           ...
2195                 218           926        845        812         969.0
2196                 218           997        908        645         981.0
2197                 218           830        823        812         975.0
2198                 218           886        974        812         975.0
2199                 218           861        991        812         981.0

      patents   score  year
0           5  100.00  2012
1           1   91.67  2012
2          15   89.50  2012
3          50   86.17  2012
4          18   85.21  2012
...       ...     ...   ...
2195      816   44.03  2015
2196      871   44.03  2015
2197      824   44.03  2015
2198      651   44.02  2015
2199      547   44.02  2015

[2200 rows x 14 columns]>

In [72]:
df_cwur.dtypes

world_rank                int64
institution              object
country                  object
national_rank             int64
quality_of_education      int64
alumni_employment         int64
quality_of_faculty        int64
publications              int64
influence                 int64
citations                 int64
broad_impact            float64
patents                   int64
score                   float64
year                      int64
dtype: object

In [77]:
# Apply describe to only numeric columns
summary = df_cwur.describe(include=[np.number])
print(summary)

        world_rank  national_rank  quality_of_education  alumni_employment  \
count  2200.000000    2200.000000           2200.000000        2200.000000
mean    459.590909      40.278182            275.100455         357.116818
std     304.320363      51.740870            121.935100         186.779252
min       1.000000       1.000000              1.000000           1.000000
25%     175.750000       6.000000            175.750000         175.750000
50%     450.500000      21.000000            355.000000         450.500000
75%     725.250000      49.000000            367.000000         478.000000
max    1000.000000     229.000000            367.000000         567.000000

       quality_of_faculty  publications    influence    citations  \
count         2200.000000   2200.000000  2200.000000  2200.000000
mean           178.888182    459.908636   459.797727   413.417273
std             64.050885    303.760352   303.331822   264.366549
min              1.000000      1.000000     1.000000     1.000000
25%            175.750000    175.750000   175.750000   161.000000
50%            210.000000    450.500000   450.500000   406.000000
75%            218.000000    725.000000   725.250000   645.000000
max            218.000000   1000.000000   991.000000   812.000000

       broad_impact      patents        score         year
count   2000.000000  2200.000000  2200.000000  2200.000000
mean     496.699500   433.346364    47.798395  2014.318182
std      286.919755   273.996525     7.760806     0.762130
min        1.000000     1.000000    43.360000  2012.000000
25%      250.500000   170.750000    44.460000  2014.000000
50%      496.000000   426.000000    45.100000  2014.000000
75%      741.000000   714.250000    47.545000  2015.000000
max     1000.000000   871.000000   100.000000  2015.000000

Not exporting the df_cwur as it stazs as original for now

# ARWU dataset

In [22]:
df_arwu= pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'shanghaiData.csv'), index_col = False)

In [23]:
df_arwu.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005
2,3,Stanford University,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005
3,4,"University of California, Berkeley",3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005
4,5,Massachusetts Institute of Technology (MIT),4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005

In [24]:
df_arwu.shape

(4897, 11)

In [34]:
# Renaming columns
df_arwu.rename(columns={
    'hici': 'Highly Cited Researchers',
    'ns': 'Number of Staff',
    'pub': 'Publications',
    'pcp': 'Publications Per Capita'
}, inplace=True)

In [35]:
df_arwu.head()

,world_rank,university_name,national_rank,total_score,alumni,award,Highly Cited Researchers,Number of Staff,Publications,Publications Per Capita,year
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005
2,3,Stanford University,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005
3,4,"University of California, Berkeley",3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005
4,5,Massachusetts Institute of Technology (MIT),4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005

In [36]:
#Finding Missing Values
df_arwu.isnull().sum()

world_rank                     0
university_name                1
national_rank                  1
total_score                 3796
alumni                         1
award                          2
Highly Cited Researchers       2
Number of Staff               22
Publications                   2
Publications Per Capita        2
year                           0
dtype: int64

In [37]:
#finding duplicates
df_dups = df_arwu[df_arwu.duplicated()]

In [38]:
df_dups

Empty DataFrame
Columns: [world_rank, university_name, national_rank, total_score, alumni, award, Highly Cited Researchers, Number of Staff, Publications, Publications Per Capita, year]
Index: []

Analyzing the data in excel I've noticed that total score is missing only for the Universities which are out of top 100 by world rank. for the purpose of my analysis top 100 universities is enough, so I would remove the rest of the data w/o total score.

In [45]:
# Filter out rows where total score is missing
df_arwu_filtered = df_arwu[df_arwu['total_score'].notna()]

In [46]:
df_arwu_filtered.shape

(1101, 11)

In [47]:
#Finding Missing Values
df_arwu_filtered.isnull().sum()

world_rank                  0
university_name             0
national_rank               0
total_score                 0
alumni                      0
award                       0
Highly Cited Researchers    0
Number of Staff             0
Publications                0
Publications Per Capita     0
year                        0
dtype: int64

In [48]:
#check for mixed types
for col in df_arwu_filtered.columns.tolist():
  weird = (df_arwu_filtered[[col]].map(type) != df_arwu_filtered[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_arwu_filtered[weird]) > 0:
    print (col)

In [73]:
df_arwu_filtered.describe

<bound method NDFrame.describe of      world_rank                              university_name national_rank  \
0             1                           Harvard University             1
1             2                      University of Cambridge             1
2             3                          Stanford University             2
3             4           University of California, Berkeley             3
4             5  Massachusetts Institute of Technology (MIT)             4
...         ...                                          ...           ...
4492         96                          McMaster University             4
4493         97                           University of Bonn             4
4494         98                      VU University Amsterdam             4
4495         99                    Michigan State University            50
4496        100                         Texas A&M University            51

      total_score  alumni  award  Highly Cited Researchers  Number of Staff  \
0           100.0   100.0  100.0                     100.0            100.0
1            73.6    99.8   93.4                      53.3             56.6
2            73.4    41.1   72.2                      88.5             70.9
3            72.8    71.8   76.0                      69.4             73.9
4            70.1    74.0   80.6                      66.7             65.8
...           ...     ...    ...                       ...              ...
4492         24.4    12.6   18.8                      23.2             15.1
4493         24.3    15.4   19.8                      17.4             21.1
4494         24.2     0.0    0.0                      27.8             18.0
4495         24.0     8.9    0.0                      30.7             21.8
4496         23.9     0.0    0.0                      34.3             22.7

      Publications  Publications Per Capita  year
0            100.0                     72.4  2005
1             70.9                     66.9  2005
2             72.3                     65.0  2005
3             72.2                     52.7  2005
4             64.3                     53.0  2005
...            ...                      ...   ...
4492          44.5                     22.5  2015
4493          39.8                     25.9  2015
4494          55.5                     33.3  2015
4495          50.6                     18.9  2015
4496          49.5                     20.9  2015

[1101 rows x 11 columns]>

In [74]:
df_arwu_filtered.dtypes

world_rank                   object
university_name              object
national_rank                object
total_score                 float64
alumni                      float64
award                       float64
Highly Cited Researchers    float64
Number of Staff             float64
Publications                float64
Publications Per Capita     float64
year                          int64
dtype: object

In [81]:
# Apply describe to only numeric columns
summary1 = df_arwu_filtered.describe(include=[np.number])
print(summary1)

       total_score       alumni        award  Highly Cited Researchers  \
count  1101.000000  1101.000000  1101.000000               1101.000000
mean     36.383470    25.576658    26.719255                 35.376748
std      13.557186    18.650148    22.021721                 16.105656
min      23.500000     0.000000     0.000000                  0.000000
25%      27.400000    14.400000    14.100000                 24.100000
50%      31.300000    21.300000    22.200000                 32.300000
75%      41.800000    32.900000    34.000000                 43.700000
max     100.000000   100.000000   100.000000                100.000000

       Number of Staff  Publications  Publications Per Capita         year
count      1101.000000   1101.000000              1101.000000  1101.000000
mean         32.587103     53.767666                31.522343  2009.989101
std          15.019464     12.279979                12.621984     3.163409
min           5.600000     19.000000                14.800000  2005.000000
25%          21.900000     45.800000                24.500000  2007.000000
50%          28.300000     52.400000                28.400000  2010.000000
75%          40.500000     62.000000                34.200000  2013.000000
max         100.000000    100.000000               100.000000  2015.000000

In [85]:
#Export df_arwu_filtered
df_arwu_filtered.to_csv(os.path.join(path, '02 Data','Prepared Data', 'df_arwu_filtered.csv'))

# THE data set

In [49]:
df_the = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'timesData.csv'), index_col = False)

In [50]:
df_the.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,-,94.2,"7,929",8.4,27%,45 : 55,2011

In [51]:
df_the.shape

(2603, 14)

In [52]:
#Finding Missing Values
df_the.isnull().sum()

world_rank                  0
university_name             0
country                     0
teaching                    0
international               0
research                    0
citations                   0
income                      0
total_score                 0
num_students               59
student_staff_ratio        59
international_students     67
female_male_ratio         233
year                        0
dtype: int64

In [55]:
#check for mixed types
for col in df_the.columns.tolist():
  weird = (df_the[[col]].map(type) != df_the[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_the[weird]) > 0:
    print (col)

num_students
international_students
female_male_ratio

In [57]:
# Check data types for specific columns
print(df_the[['num_students', 'international_students', 'female_male_ratio']].dtypes)

num_students              object
international_students    object
female_male_ratio         object
dtype: object

In [102]:
# Replace non-numeric values (e.g., '-' or ' -') with NaN for the relevant columns
df_the['num_students'] = df_the['num_students'].replace({' -': pd.NA, '-': pd.NA})
df_the['international_students'] = df_the['international_students'].replace({' -': pd.NA, '-': pd.NA})
df_the['student_staff_ratio'] = df_the['student_staff_ratio'].replace({' -': pd.NA, '-': pd.NA})

# Convert the columns to numeric type (float), coerce any invalid values to NaN
df_the['num_students'] = pd.to_numeric(df_the['num_students'], errors='coerce')
df_the['international_students'] = pd.to_numeric(df_the['international_students'], errors='coerce')
df_the['student_staff_ratio'] = pd.to_numeric(df_the['student_staff_ratio'], errors='coerce')

In [103]:
# Create a new DataFrame to preserve the original one
df_the_filled1 = df_the.copy()

# Fill missing values with the median in the new df
df_the_filled1['num_students'].fillna(df_the_filled1['num_students'].median(), inplace=True)
df_the_filled1['student_staff_ratio'].fillna(df_the_filled1['student_staff_ratio'].median(), inplace=True)
df_the_filled1['international_students'].fillna(df_the_filled1['international_students'].median(), inplace=True)

/var/folders/rs/zynz_jf95m96kh0kp832ghnr0000gn/T/ipykernel_4562/3230262418.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_the_filled1['num_students'].fillna(df_the_filled1['num_students'].median(), inplace=True)
/var/folders/rs/zynz_jf95m96kh0kp832ghnr0000gn/T/ipykernel_4562/3230262418.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_the_filled1['student_staff_ratio'].fillna(df_the_filled1['student_staff_ratio'].median(), inplace=True)
/var/folders/rs/zynz_jf95m96kh0kp832ghnr0000gn/T/ipykernel_4562/3230262418.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_the_filled1['international_students'].fillna(df_the_filled1['international_students'].median(), inplace=True)

In [104]:
df_the_filled1.isnull().sum()

world_rank                   0
university_name              0
country                      0
teaching                     0
international                0
research                     0
citations                    0
income                       0
total_score                  0
num_students                 0
student_staff_ratio          0
international_students    2603
female_male_ratio          233
year                         0
dtype: int64

In [63]:
df_the.isnull().sum()

world_rank                   0
university_name              0
country                      0
teaching                     0
international                0
research                     0
citations                    0
income                       0
total_score                  0
num_students              2600
student_staff_ratio         59
international_students    2603
female_male_ratio          233
year                         0
dtype: int64

In [105]:
df_the_filled1.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,462.0,8.9,NaN,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,462.0,6.9,NaN,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,462.0,9.0,NaN,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,462.0,7.8,NaN,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,-,94.2,462.0,8.4,NaN,45 : 55,2011

In [106]:
# Drop columns with missing values since not relevent for analysis
columns_to_remove = [ 'international_students', 'female_male_ratio']
df_the_filled1.drop(columns=columns_to_remove, inplace=True)

# Check the updated DataFrame
print(df_the_filled1.head())

  world_rank                        university_name                   country  \
0          1                     Harvard University  United States of America
1          2     California Institute of Technology  United States of America
2          3  Massachusetts Institute of Technology  United States of America
3          4                    Stanford University  United States of America
4          5                   Princeton University  United States of America

   teaching international  research  citations income total_score  \
0      99.7          72.4      98.7       98.8   34.5        96.1
1      97.7          54.6      98.0       99.9   83.7        96.0
2      97.8          82.3      91.4       99.9   87.5        95.6
3      98.3          29.5      98.1       99.2   64.3        94.3
4      90.9          70.3      95.4       99.9      -        94.2

   num_students  student_staff_ratio  year
0         462.0                  8.9  2011
1         462.0                  6.9  2011
2         462.0                  9.0  2011
3         462.0                  7.8  2011
4         462.0                  8.4  2011

In [107]:
df_dups2 = df_the_filled1[df_the_filled1.duplicated()]

In [108]:
df_dups2

Empty DataFrame
Columns: [world_rank, university_name, country, teaching, international, research, citations, income, total_score, num_students, student_staff_ratio, year]
Index: []

In [110]:
df_the_filled1.dtypes

world_rank              object
university_name         object
country                 object
teaching               float64
international           object
research               float64
citations              float64
income                  object
total_score             object
num_students           float64
student_staff_ratio    float64
year                     int64
dtype: object

In [82]:
# Apply describe to only numeric columns
summary2 = df_the_filled.describe(include=[np.number])
print(summary2)

          teaching     research    citations         year
count  2603.000000  2603.000000  2603.000000  2603.000000
mean     37.801498    35.910257    60.921629  2014.075682
std      17.604218    21.254805    23.073219     1.685733
min       9.900000     2.900000     1.200000  2011.000000
25%      24.700000    19.600000    45.500000  2013.000000
50%      33.900000    30.500000    62.500000  2014.000000
75%      46.400000    47.250000    79.050000  2016.000000
max      99.700000    99.400000   100.000000  2016.000000

In [111]:
# Replace ' -' with NaN (Not a Number)
df_the_filled1['income'] = df_the_filled1['income'].replace(' -', pd.NA)

In [114]:
df_the_filled1['income'] = pd.to_numeric(df_the_filled1['income'], errors='coerce')

In [97]:
# Replace ' -' with NaN (Not a Number)
df_the_filled1['total_score'] = df_the_filled1['total_score'].replace({' -': pd.NA, '-': pd.NA})
df_the_filled1['international'] = df_the_filled1['international'].replace({' -': pd.NA, '-': pd.NA})

In [115]:
# Convert the columns to float type, coercing any invalid values to NaN
df_the_filled1['total_score'] = pd.to_numeric(df_the_filled1['total_score'], errors='coerce')
df_the_filled1['international'] = pd.to_numeric(df_the_filled1['international'], errors='coerce')

In [116]:
# Apply describe to only numeric columns
summary2 = df_the_filled1.describe(include=[np.number])
print(summary2)

          teaching  international     research    citations       income  \
count  2603.000000    2594.000000  2603.000000  2603.000000  2385.000000
mean     37.801498      52.007440    35.910257    60.921629    48.979874
std      17.604218      22.103825    21.254805    23.073219    21.179938
min       9.900000       7.100000     2.900000     1.200000    24.200000
25%      24.700000      33.425000    19.600000    45.500000    33.000000
50%      33.900000      50.300000    30.500000    62.500000    41.000000
75%      46.400000      69.000000    47.250000    79.050000    59.000000
max      99.700000     100.000000    99.400000   100.000000   100.000000

       total_score  num_students  student_staff_ratio         year
count  1201.000000   2603.000000          2603.000000  2603.000000
mean     59.846128    462.117941            18.392124  2014.075682
std      12.803446      6.017295            11.333420     1.685733
min      41.400000    462.000000             0.600000  2011.000000
25%      50.300000    462.000000            12.050000  2013.000000
50%      56.000000    462.000000            16.100000  2014.000000
75%      66.200000    462.000000            21.200000  2016.000000
max      96.100000    769.000000           162.600000  2016.000000

In [117]:
#Export df_arwu_filtered
df_the_filled1.to_csv(os.path.join(path, '02 Data','Prepared Data', 'df_the_filled.csv'))